/* ********************************************************************* 
       _____        _               _    ___ ____   ____
      |_   _|___  _| |_ _   _  __ _| |  |_ _|  _ \ / ___|
       | |/ _ \ \/ / __| | | |/ _` | |   | || |_) | |
       | |  __/>  <| |_| |_| | (_| | |   | ||  _ <| |___
       |_|\___/_/\_\\__|\__,_|\__,_|_|  |___|_| \_\\____|

 Copyright (c) 2010 — 2013 Codeux Software & respective contributors.
        Please see Contributors.pdf and Acknowledgements.pdf

 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions
 are met:

    * Redistributions of source code must retain the above copyright
      notice, this list of conditions and the following disclaimer.
    * Redistributions in binary form must reproduce the above copyright
      notice, this list of conditions and the following disclaimer in the
      documentation and/or other materials provided with the distribution.
    * Neither the name of the Textual IRC Client & Codeux Software nor the
      names of its contributors may be used to endorse or promote products
      derived from this software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
 ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
 FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 SUCH DAMAGE.

 *********************************************************************** */

"BlowfishNoEncryptionKeySet" = "Kein Verschlüsselungs-Passwort gesetzt.";
"BlowfishCurrentEncryptionKey" = "Aktueller Verschlüsselungs-Passwort: %@";

"BlowfishEncryptionStartedInPrivateMessage" = "Verschlüsselung starten im Query. Wenn dieses Query geschlossen wird, muss der Schlüssel erneut gesetzt werden.";

"BlowfishKeyExchangeSuccessful_1" = "Schlüssel erfolgreich ausgetauscht. Nachrichten die an \002%@\002 gesendet werden, werden nun verschlüsselt.";
"BlowfishKeyExchangeSuccessful_2" = "\002Warnung:\002 Wenn dieses Query geschlossen wird, ist ein neuer Schlüsselaustausch erforderlich um den verschlüsselten Chat fortzusetzen.";
"BlowfishKeyExchangeForQueriesOnly" = "Schlüsselaustausch ist nur für Queries.";
"BlowfishKeyExchangeRequestAlreadyExists" = "Eine Schlüsselaustausch-Anfrage existiert bereits für \002%@\002. Bitte warten sie bis der aktuelle abgelaufen ist, bevor du einen neuen anforderst.";
"BlowfishKeyExchangeRequestReceived" = "Schlüsselaustausch-Anfrage von \002%@\002 erhalten, Bearbeite ...";
"BlowfishKeyExchangeRequestSent" = "Schlüselaustausch-Anfrage wurde an \002%@\002 gesendet.";
"BlowfishKeyExchangeRequestTimedOut" = "Schlüsselaustausch-Anfrage für \002%@\002 ist abgelaufen.";
"BlowfishKeyExchangeResponseSent" = "Schlüsselaustausch-Antwort wurde an \002%@\002 gesendet.";
"BlowfishKeyExchangeResponseReceived" = "Schlüsselaustausch-Antwort von \002%@\002 erhalten. Bearbeite ...";

"BlowfishKeyExchangeCannotHandleEncryptedRequest_1" = "Kann Schlüsselaustausch-Anfrage von \002%@\002 nicht bearbeiten, bevor die aktuellen Schlüssel nicht zurück gesetzt wurden.";
"BlowfishKeyExchangeCannotHandleEncryptedRequest_2" = "Cannot process key exchange request for \002%@\002 until the active encryption keys are reset.";

"BlowfishKeyExchangeErrorOccurred_1" = "Key exchange failed: failure to generate public key.";
"BlowfishKeyExchangeErrorOccurred_2" = "Key exchange failed: failure to compute secret from public key.";
